# 需要安装的包

```
pip install ipython-sql
pip install sqlalchemy
```

对于 mysql，还需要安装

```
pip install PyMySQL
pip install mysqlclient
```

对于postgressql,还需要安装

```
pip install psycopg2
```

In [1]:
# 加载包
%load_ext sql

In [2]:
# 链接数据库
%sql mysql+mysqldb://root:root@localhost/sakila

# %sql postgresql://postgres:password123@localhost/dvdrental

In [5]:
res= %sql select * from actor;
res2=res.DataFrame()

 * mysql+mysqldb://root:***@localhost/sakila
200 rows affected.

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [6]:
res2.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [ ]:
# 查询结果赋值及转换为 data frame

res=%sql select * from film limit 5;
res.DataFrame()
res

In [ ]:
# 变量替换

length_var=90
%sql select * from film where length< :length_var;

In [7]:
%%sql
show databases;

 * mysql+mysqldb://root:***@localhost/sakila
7 rows affected.

[('db8',),
 ('information_schema',),
 ('mysql',),
 ('northwind',),
 ('performance_schema',),
 ('sakila',),
 ('sys',)]

In [8]:
%sql use northwind;

 * mysql+mysqldb://root:***@localhost/sakila
0 rows affected.

[]

In [9]:
%sql show tables;

 * mysql+mysqldb://root:***@localhost/sakila
29 rows affected.

[('alphabetical list of products',),
 ('categories',),
 ('category sales for 1997',),
 ('current product list',),
 ('customer and suppliers by city',),
 ('customercustomerdemo',),
 ('customerdemographics',),
 ('customers',),
 ('employees',),
 ('employeeterritories',),
 ('invoices',),
 ('order details',),
 ('order details extended',),
 ('order subtotals',),
 ('orders',),
 ('orders qry',),
 ('product sales for 1997',),
 ('products',),
 ('products above average price',),
 ('products by category',),
 ('quarterly orders',),
 ('region',),
 ('sales by category',),
 ('sales totals by amount',),
 ('shippers',),
 ('summary of sales by quarter',),
 ('summary of sales by year',),
 ('suppliers',),
 ('territories',)]

In [10]:
%sql select * from customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitucin 2222', 'Mxico D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquera', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'Mxico D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbkp', 'Christina Berglund', 'Order Administrator', 'Berguvsvgen  8', 'Lule', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67'),
 ('BLAUS', 'Blauer See Delikatessen', 'Hanna Moos', 'Sales Representative', 'Forsterstr. 57', 'Mannheim', None, '68306', 'Germany', '0621-08460', '0621-08924'),
 ('BLONP', 'Blondesddsl pre et fils', 'Frdrique Citeaux', 'Marketing Manager', '24, place Klber', 'Strasbourg', None, '67000', 'France', '88.60.15.31', '88.60.15.32'),
 ('BOLID', 'Blido Comidas preparadas', 'Martn Sommer', 'Owner', 'C/ Araquil, 67', 'Madrid', None, '28023', 'Spain', '(91) 555 22 82', '(91) 555 91 99'),
 ('BONAP', "Bon app'", 'Laurence Lebihan', 'Owner', '12, rue des Bouchers', 'Marseille', None, '13008', 'France', '91.24.45.40', '91.24.45.41'),
 ('BOTTM', 'Bottom-Dollar Markets', 'Elizabeth Lincoln', 'Accounting Manager', '23 Tsawassen Blvd.', 'Tsawassen', 'BC', 'T2F 8M4', 'Canada', '(604) 555-4729', '(604) 555-3745'),
 ('BSBEV', "B's Beverages", 'Victoria Ashworth', 'Sales Representative', 'Fauntleroy Circus', 'London', None, 'EC2 5NT', 'UK', '(171) 555-1212', None),
 ('CACTU', 'Cactus Comidas para llevar', 'Patricio Simpson', 'Sales Agent', 'Cerrito 333', 'Buenos Aires', None, '1010', 'Argentina', '(1) 135-5555', '(1) 135-4892'),
 ('CENTC', 'Centro comercial Moctezuma', 'Francisco Chang', 'Marketing Manager', 'Sierras de Granada 9993', 'Mxico D.F.', None, '05022', 'Mexico', '(5) 555-3392', '(5) 555-7293'),
 ('CHOPS', 'Chop-suey Chinese', 'Yang Wang', 'Owner', 'Hauptstr. 29', 'Bern', None, '3012', 'Switzerland', '0452-076545', None),
 ('COMMI', 'Comrcio Mineiro', 'Pedro Afonso', 'Sales Associate', 'Av. dos Lusadas, 23', 'Sao Paulo', 'SP', '05432-043', 'Brazil', '(11) 555-7647', None),
 ('CONSH', 'Consolidated Holdings', 'Elizabeth Brown', 'Sales Representative', 'Berkeley Gardens 12  Brewery', 'London', None, 'WX1 6LT', 'UK', '(171) 555-2282', '(171) 555-9199'),
 ('DRACD', 'Drachenblut Delikatessen', 'Sven Ottlieb', 'Order Administrator', 'Walserweg 21', 'Aachen', None, '52066', 'Germany', '0241-039123', '0241-059428'),
 ('DUMON', 'Du monde entier', 'Janine Labrune', 'Owner', '67, rue des Cinquante Otages', 'Nantes', None, '44000', 'France', '40.67.88.88', '40.67.89.89'),
 ('EASTC', 'Eastern Connection', 'Ann Devon', 'Sales Agent', '35 King George', 'London', None, 'WX3 6FW', 'UK', '(171) 555-0297', '(171) 555-3373'),
 ('ERNSH', 'Ernst Handel', 'Roland Mendel', 'Sales Manager', 'Kirchgasse 6', 'Graz', None, '8010', 'Austria', '7675-3425', '7675-3426')]

### ASCII()

- ASCII（）函数返回特定字符的ASCII值
- 如果输入了多个字符，它将只返回第一个字符的值

In [12]:
%sql select ascii(CompanyName) from customers limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(65,), (65,), (65,), (65,), (66,), (66,), (66,), (66,), (66,), (66,)]

### char_length() & CHARACTER_LENGTH()

- 返回字符串的长度;
- 两个函数等价

In [19]:
%sql SELECT CHAR_LENGTH(ContactName) AS LengthOfName FROM Customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[(12,),
 (12,),
 (14,),
 (12,),
 (18,),
 (10,),
 (16,),
 (12,),
 (16,),
 (17,),
 (17,),
 (16,),
 (15,),
 (9,),
 (12,),
 (15,),
 (12,),
 (14,),
 (9,),
 (13,)]

### concat()

- CONCAT(expression1, expression2, expression3,...)
- 用于拼接字符串
- 如果任何表达式为NULL值，则返回NULL

In [39]:
%sql SELECT CONCAT(Country,'+', city) AS Address FROM Customers limit 20;
# %sql SELECT CONCAT(Country,"", city) AS Address FROM Customers limit 20;

 * mysql+mysqldb://root:***@localhost/sakila
20 rows affected.

[('Germany+Berlin',),
 ('Mexico+Mxico D.F.',),
 ('Mexico+Mxico D.F.',),
 ('UK+London',),
 ('Sweden+Lule',),
 ('Germany+Mannheim',),
 ('France+Strasbourg',),
 ('Spain+Madrid',),
 ('France+Marseille',),
 ('Canada+Tsawassen',),
 ('UK+London',),
 ('Argentina+Buenos Aires',),
 ('Mexico+Mxico D.F.',),
 ('Switzerland+Bern',),
 ('Brazil+Sao Paulo',),
 ('UK+London',),
 ('Germany+Aachen',),
 ('France+Nantes',),
 ('UK+London',),
 ('Austria+Graz',)]

### concat_ws()

- CONCAT_WS(separator, expression1, expression2, expression3,...)
- 将多个表达式相加，并在它们之间添加一个“-”分隔符
- 其中separator是必需的，即在每个表达式之间添加的分隔符。如果分隔符为NULL，则此函数返回NULL。
- 该函数将跳过具有NULL值的表达式

In [41]:
%sql SELECT CONCAT_ws('+',Country, city) AS Address FROM Customers limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[('Germany+Berlin',),
 ('Mexico+Mxico D.F.',),
 ('Mexico+Mxico D.F.',),
 ('UK+London',),
 ('Sweden+Lule',),
 ('Germany+Mannheim',),
 ('France+Strasbourg',),
 ('Spain+Madrid',),
 ('France+Marseille',),
 ('Canada+Tsawassen',)]

### field()

- FIELD(value, val1, val2, val3, ...) 返回字符串列表中“q”的索引位置
- 函数返回值列表中某个值的索引位置
- 此函数执行不区分大小写的搜索。
- 注意：如果在值列表中找不到指定的值，此函数将返回0。如果值为NULL，此函数将返回0。

In [48]:
# %sql SELECT FIELD('q', 's', 'q', 'l');
%sql SELECT FIELD('None',City,Region,address) from customers limit 10;
%sql SELECT FIELD('Berlin',City,Region,address) from customers limit 10;

 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.
 * mysql+mysqldb://root:***@localhost/sakila
10 rows affected.

[(1,), (0,), (0,), (0,), (0,), (0,), (0,), (0,), (0,), (0,)]

### find_in_set()

- FIND_IN_SET(string, string_list) 在字符串列表string_list中搜索string：
- 函数的作用是返回字符串列表中字符串的位置。
- 如果在string_list中找不到字符串，则此函数返回0
- 如果字符串或字符串列表为NULL，则此函数返回NULL
- 如果string_list是空字符串（“”），则此函数返回0

In [57]:
%%sql 
SELECT FIND_IN_SET('q', null);
SELECT FIND_IN_SET('q', ' ');
select find_in_set('e',Country) from customers;

 * mysql+mysqldb://root:***@localhost/sakila
1 rows affected.
1 rows affected.
93 rows affected.

[(0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (None,),
 (None,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,),
 (0,)]

### format()

- FORMAT(number, decimal_places)
- FORMAT（）函数将数字格式化为类似“#，####，###.##”的格式，四舍五入到指定的小数位数，然后将结果作为字符串返回。
- number:要格式化的数字；decimal_places：数字的小数位数。如果此参数为0，则此函数返回一个没有小数位数的字符串

### insert()

- INSERT(string, position, number, string2)
- 该函数在指定位置的字符串中插入一定数量的字符
- string是将要修改的字符串；position是插入字符串的位置；number是要替换的字符数；string2是要插入字符串的字符串
- 如果位置在字符串长度之外，此函数将返回字符串
- 如果数字大于字符串其余部分的长度，则此函数将替换从位置到字符串末尾的字符串

### instr()

- INSTR(string1, string2)
- string1是将要搜索的字符串；string2是要在字符串1中搜索的字符串，如果找不到string2，返回0
- 该函数返回一个字符串在另一个字符串中第一次出现的位置
- 此函数执行不区分大小写的搜索。

### lcase()

- LCASE(text)
- 该函数的作用是将字符串转换为小写。
- LOWER（）函数效果与LCASE（）相同

### left()

- LEFT(string, number_of_chars)
- string是要从中提取的字符串；number_of_chars是要提取的字符数。如果此参数大于字符串中的字符数，则此函数将返回字符串
- LEFT（）函数从字符串中提取多个字符（从左起）
- 从右提取是RIGHT（）函数。

### length()

- LENGTH(string)
- LENGTH（）函数返回字符串的长度（以字节为单位）

In [ ]:
%sql SELECT LENGTH(CustomerName) AS LengthOfName FROM Customers;